{
  "courses": [
    {
      "id": 1,
      "content": "Muhteşem Angular Kursu ile modern web geliştirmeye adım atın. Angular framework’ünün güçlü yönlerini öğrenerek bileşen tabanlı mimari, veri bağlama, servisler, yönlendirme ve HTTP istekleri gibi konularda uzmanlaşın. Pratik örnekler ve gerçek proje çalışmalarıyla hem frontend becerilerinizi geliştirin hem de kariyerinizde büyük bir adım atın. Sıfırdan ileri seviyeye kadar rehberli ilerleyin.",
      "title": "Angular",
      "price": 100
    },
    {
      "id": 2,
      "content": "Bootstrap ile modern arayüz tasarımına güçlü bir başlangıç yapın. Bileşen tabanlı yaklaşım, grid sistemi, responsive tasarım, yardımcı sınıflar, formlar, butonlar ve kartlar ile hızla profesyonel görünümler üretin. Sass desteği, ikonlar, modal ve offcanvas gibi etkileşimli öğelerle proje deneyiminizi zenginleştirin. Gerçek dünya örnekleri, en iyi pratikler ve performans ipuçlarıyla, temel seviyeden ileri düzeye güvenle ilerleyin. Canlı demo ve mini projelerle.",
      "title": "Bootstrap",
      "price": 100
    },
    {
      "id": 3,
      "content": "C Programlama kursu ile yazılım dünyasına sağlam bir temel atın. Değişkenler, veri tipleri, operatörler, döngüler, fonksiyonlar ve göstergeler gibi temel konuları öğrenin. Bellek yönetimi, dosya işlemleri ve algoritma geliştirme becerilerinizi geliştirin. Gerçek uygulama örnekleri ve proje çalışmaları ile hem akademik hem de profesyonel hayatta güçlü bir başlangıç yapın. Ek alıştırmalar ve quizler içerir.",
      "title": "C Programlama",
      "price": 100
    },
    {
      "id": 4,
      "content": "Frontend geliştirme kursu ile HTML, CSS ve JavaScript teknolojilerini derinlemesine öğrenin. Modern kullanıcı arayüzleri, etkileşimli sayfalar ve responsive tasarım teknikleriyle profesyonel web siteleri oluşturun. API entegrasyonları, form yönetimi, animasyonlar ve en iyi pratikler ile frontend dünyasında güçlü bir yere sahip olun. Canlı dersler ve proje desteği sunar.",
      "title": "Frontend Kursu",
      "price": 100
    },
    {
      "id": 5,
      "content": "HTML kursu ile web sayfalarının temel yapı taşlarını öğrenin. Etiketler, başlıklar, paragraflar, bağlantılar, resimler, listeler ve tablolar ile zengin içerikler oluşturun. Form elemanları, semantik etiketler ve erişilebilirlik standartları hakkında bilgi sahibi olun. Pratik örnekler ve mini projelerle öğrendiklerinizi pekiştirin. Uygulamalı eğitim ve sertifika imkanı.",
      "title": "Html Kursu",
      "price": 0
    }
  ]
}
